{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "AHardwareBuffer_Plane [4]",
   "name" : "AHardwareBuffer_Plane [4]",
   "referenced_type" : "type-509",
   "self_type" : "type-508",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::details::TVec3<float> [3]",
   "name" : "android::details::TVec3<float> [3]",
   "referenced_type" : "type-17",
   "self_type" : "type-904",
   "size" : 36,
   "source_file" : "/frameworks/native/libs/math/include/math/mat3.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::details::TVec4<float> [4]",
   "name" : "android::details::TVec4<float> [4]",
   "referenced_type" : "type-200",
   "self_type" : "type-2277",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/math/include/math/mat4.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-288",
   "self_type" : "type-1261",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-10",
   "self_type" : "type-1231",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-103",
   "self_type" : "type-145",

   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-479",
   "self_type" : "type-478",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-634",
   "self_type" : "type-633",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-727",
   "self_type" : "type-726",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-833",
   "self_type" : "type-832",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-960",
   "self_type" : "type-959",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-218",
   "self_type" : "type-224",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-123",
   "self_type" : "type-236",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-124",
   "self_type" : "type-226",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-3",
   "self_type" : "type-830",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-151",
   "self_type" : "type-1118",
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned int const[3]",
   "name" : "unsigned int const[3]",
   "referenced_type" : "type-941",
   "self_type" : "type-948",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-6",
   "self_type" : "type-270",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-103",
   "self_type" : "type-275",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Desc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 32,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "planes",
     "field_offset" : 32,
     "referenced_type" : "type-508"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "type-507",
   "self_type" : "type-507",
   "size" : 52,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Planes"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "width",
     "field_offset" : 256,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "height",
     "field_offset" : 288,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "stride",
     "field_offset" : 320,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "format",
     "field_offset" : 352,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 384,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 416,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 448,
     "referenced_type" : "type-523"
    },
    {
     "field_name" : "handle",
     "field_offset" : 480,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "usage",
     "field_offset" : 512,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 576,
     "referenced_type" : "type-524"
    }
   ],
   "linker_set_key" : "ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "ANativeWindowBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "ARect",
   "name" : "ARect",
   "referenced_type" : "type-1242",
   "self_type" : "type-1242",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h",
   "unique_id" : "ARect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 512,
     "referenced_type" : "type-602"
    },
    {
     "field_name" : "free",
     "field_offset" : 544,
     "referenced_type" : "type-605"
    },
    {
     "field_name" : "dump",
     "field_offset" : 576,
     "referenced_type" : "type-607"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 608,
     "referenced_type" : "type-609"
    }
   ],
   "linker_set_key" : "alloc_device_t",
   "name" : "alloc_device_t",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 104,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h",
   "unique_id" : "alloc_device_t"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-517"
    },
    {
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "name" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "record_kind" : "class",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 104,
   "source_file" : "/frameworks/native/libs/ui/include/ui/ANativeObjectBase.h",
   "template_args" : [ "type-517", "type-525", "type-172", "type-518" ],
   "unique_id" : "_ZTSN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mName",
     "referenced_type" : "type-980"
    },
    {
     "access" : "private",
     "field_name" : "mRGBtoXYZ",
     "field_offset" : 96,
     "referenced_type" : "type-903"
    },
    {
     "access" : "private",
     "field_name" : "mXYZtoRGB",
     "field_offset" : 384,
     "referenced_type" : "type-903"
    },
    {
     "access" : "private",
     "field_name" : "mParameters",
     "field_offset" : 672,
     "referenced_type" : "type-981"
    },
    {
     "access" : "private",
     "field_name" : "mOETF",
     "field_offset" : 896,
     "referenced_type" : "type-982"
    },
    {
     "access" : "private",
     "field_name" : "mEOTF",
     "field_offset" : 1088,
     "referenced_type" : "type-983"
    },
    {
     "access" : "private",
     "field_name" : "mClamper",
     "field_offset" : 1280,
     "referenced_type" : "type-984"
    },
    {
     "access" : "private",
     "field_name" : "mPrimaries",
     "field_offset" : 1472,
     "referenced_type" : "type-985"
    },
    {
     "access" : "private",
     "field_name" : "mWhitePoint",
     "field_offset" : 1664,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "android::ColorSpace",
   "name" : "android::ColorSpace",
   "record_kind" : "class",
   "referenced_type" : "type-979",
   "self_type" : "type-979",
   "size" : 216,
   "source_file" : "/frameworks/native/libs/ui/include/ui/ColorSpace.h",
   "unique_id" : "_ZTSN7android10ColorSpaceE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "g",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "a",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "c",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "d",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e",
     "field_offset" : 160,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "f",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::ColorSpace::TransferParameters",
   "name" : "android::ColorSpace::TransferParameters",
   "referenced_type" : "type-981",
   "self_type" : "type-981",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/ui/include/ui/ColorSpace.h",
   "unique_id" : "_ZTSN7android10ColorSpace18TransferParametersE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSource",
     "referenced_type" : "type-979"
    },
    {
     "access" : "private",
     "field_name" : "mDestination",
     "field_offset" : 1728,
     "referenced_type" : "type-979"
    },
    {
     "access" : "private",
     "field_name" : "mTransform",
     "field_offset" : 3456,
     "referenced_type" : "type-903"
    }
   ],
   "linker_set_key" : "android::ColorSpaceConnector",
   "name" : "android::ColorSpaceConnector",
   "record_kind" : "class",
   "referenced_type" : "type-1043",
   "self_type" : "type-1043",
   "size" : 472,
   "source_file" : "/frameworks/native/libs/ui/include/ui/ColorSpace.h",
   "unique_id" : "_ZTSN7android19ColorSpaceConnectorE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-1247",
   "self_type" : "type-1247",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-259"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1342"
    },
    {
     "referenced_type" : "type-1344"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFenceFd",
     "field_offset" : 32,
     "referenced_type" : "type-1341"
    }
   ],
   "linker_set_key" : "android::Fence",
   "name" : "android::Fence",
   "record_kind" : "class",
   "referenced_type" : "type-1340",
   "self_type" : "type-1340",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Fence.h",
   "unique_id" : "_ZTSN7android5FenceE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mState",
     "referenced_type" : "type-1377"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-1379"
    },
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 64,
     "referenced_type" : "type-1357"
    },
    {
     "access" : "private",
     "field_name" : "mSignalTime",
     "field_offset" : 128,
     "referenced_type" : "type-1380"
    }
   ],
   "linker_set_key" : "android::FenceTime",
   "name" : "android::FenceTime",
   "record_kind" : "class",
   "referenced_type" : "type-1376",
   "self_type" : "type-1376",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTimeE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1385"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-1384"
    },
    {
     "field_name" : "fence",
     "field_offset" : 32,
     "referenced_type" : "type-1357"
    },
    {
     "field_name" : "signalTime",
     "field_offset" : 64,
     "referenced_type" : "type-284"
    }
   ],
   "linker_set_key" : "android::FenceTime::Snapshot",
   "name" : "android::FenceTime::Snapshot",
   "referenced_type" : "type-1383",
   "self_type" : "type-1383",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTime8SnapshotE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1398"
    },
    {
     "access" : "private",
     "field_name" : "mQueue",
     "field_offset" : 32,
     "referenced_type" : "type-1399"
    }
   ],
   "linker_set_key" : "android::FenceTimeline",
   "name" : "android::FenceTimeline",
   "record_kind" : "class",
   "referenced_type" : "type-1397",
   "self_type" : "type-1397",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android13FenceTimelineE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1403"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1404"
    }
   ],
   "linker_set_key" : "android::FenceToFenceTimeMap",
   "name" : "android::FenceToFenceTimeMap",
   "record_kind" : "class",
   "referenced_type" : "type-1402",
   "self_type" : "type-1402",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android19FenceToFenceTimeMapE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::Fence>",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-1344",
   "self_type" : "type-1344",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1340" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_5FenceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FenceTime::Snapshot>",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "type-1385",
   "self_type" : "type-1385",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1383" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_9FenceTime8SnapshotEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::GraphicBuffer>",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-532",
   "self_type" : "type-532",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-1248",
   "self_type" : "type-1248",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::FloatRect",
   "name" : "android::FloatRect",
   "record_kind" : "class",
   "referenced_type" : "type-1275",
   "self_type" : "type-1275",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FloatRect.h",
   "unique_id" : "_ZTSN7android9FloatRectE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1419"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "refreshPeriodNano",
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "desiredPresentTimesNano",
     "field_offset" : 64,
     "referenced_type" : "type-1421"
    },
    {
     "field_name" : "actualPresentTimesNano",
     "field_offset" : 224,
     "referenced_type" : "type-1421"
    },
    {
     "field_name" : "frameReadyTimesNano",
     "field_offset" : 384,
     "referenced_type" : "type-1421"
    }
   ],
   "linker_set_key" : "android::FrameStats",
   "name" : "android::FrameStats",
   "record_kind" : "class",
   "referenced_type" : "type-1420",
   "self_type" : "type-1420",
   "size" : 72,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FrameStats.h",
   "unique_id" : "_ZTSN7android10FrameStatsE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMapper",
     "field_offset" : 32,
     "referenced_type" : "type-354"
    },
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 64,
     "referenced_type" : "type-355"
    }
   ],
   "linker_set_key" : "android::Gralloc2Allocator",
   "name" : "android::Gralloc2Allocator",
   "record_kind" : "class",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Gralloc2.h",
   "unique_id" : "_ZTSN7android17Gralloc2AllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17Gralloc2AllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17Gralloc2AllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17Gralloc2AllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android17Gralloc2Allocator8isLoadedEv"
    },
    {
     "mangled_component_name" : "_ZNK7android17Gralloc2Allocator13dumpDebugInfoEv"
    },
    {
     "mangled_component_name" : "_ZNK7android17Gralloc2Allocator8allocateEjjijyjPjPPK13native_handle"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-342"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMapper",
     "field_offset" : 32,
     "referenced_type" : "type-338"
    },
    {
     "access" : "private",
     "field_name" : "mMapperV2_1",
     "field_offset" : 64,
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "android::Gralloc2Mapper",
   "name" : "android::Gralloc2Mapper",
   "record_kind" : "class",
   "referenced_type" : "type-337",
   "self_type" : "type-337",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Gralloc2.h",
   "unique_id" : "_ZTSN7android14Gralloc2MapperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14Gralloc2MapperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14Gralloc2MapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14Gralloc2MapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper8isLoadedEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper16createDescriptorEPvS1_"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper12importBufferERKNS_8hardware11hidl_handleEPPK13native_handle"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper10freeBufferEPK13native_handle"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper18validateBufferSizeEPK13native_handlejjijyj"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper16getTransportSizeEPK13native_handlePjS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper4lockEPK13native_handleyRKNS_4RectEiPPvPiS9_"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper4lockEPK13native_handleyRKNS_4RectEiP13android_ycbcr"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper6unlockEPK13native_handle"
    },
    {
     "mangled_component_name" : "_ZNK7android14Gralloc2Mapper11isSupportedEjjijyPb"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-516"
    },
    {
     "referenced_type" : "type-532"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 832,
     "referenced_type" : "type-218"
    },
    {
     "access" : "private",
     "field_name" : "mBufferMapper",
     "field_offset" : 864,
     "referenced_type" : "type-526"
    },
    {
     "access" : "private",
     "field_name" : "mInitCheck",
     "field_offset" : 896,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumFds",
     "field_offset" : 928,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumInts",
     "field_offset" : 960,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mId",
     "field_offset" : 1024,
     "referenced_type" : "type-124"
    },
    {
     "access" : "private",
     "field_name" : "mBufferId",
     "field_offset" : 1088,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mGenerationNumber",
     "field_offset" : 1120,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mDeathCallbacks",
     "field_offset" : 1152,
     "referenced_type" : "type-531"
    }
   ],
   "linker_set_key" : "android::GraphicBuffer",
   "name" : "android::GraphicBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 160,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBuffer.h",
   "unique_id" : "_ZTSN7android13GraphicBufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13GraphicBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-541"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMapper",
     "referenced_type" : "type-526"
    },
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-543"
    }
   ],
   "linker_set_key" : "android::GraphicBufferAllocator",
   "name" : "android::GraphicBufferAllocator",
   "record_kind" : "class",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBufferAllocator.h",
   "unique_id" : "_ZTSN7android22GraphicBufferAllocatorE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 128,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "usage",
     "field_offset" : 192,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "size",
     "field_offset" : 256,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "requestorName",
     "field_offset" : 288,
     "referenced_type" : "type-677"
    }
   ],
   "linker_set_key" : "android::GraphicBufferAllocator::alloc_rec_t",
   "name" : "android::GraphicBufferAllocator::alloc_rec_t",
   "referenced_type" : "type-676",
   "self_type" : "type-676",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBufferAllocator.h",
   "unique_id" : "_ZTSN7android22GraphicBufferAllocator11alloc_rec_tE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-530"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMapper",
     "referenced_type" : "type-528"
    },
    {
     "access" : "private",
     "field_name" : "mMapperVersion",
     "field_offset" : 32,
     "referenced_type" : "type-529"
    }
   ],
   "linker_set_key" : "android::GraphicBufferMapper",
   "name" : "android::GraphicBufferMapper",
   "record_kind" : "class",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBufferMapper.h",
   "unique_id" : "_ZTSN7android19GraphicBufferMapperE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-963"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSupportedHdrTypes",
     "referenced_type" : "type-965"
    },
    {
     "access" : "private",
     "field_name" : "mMaxLuminance",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mMaxAverageLuminance",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mMinLuminance",
     "field_offset" : 160,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::HdrCapabilities",
   "name" : "android::HdrCapabilities",
   "record_kind" : "class",
   "referenced_type" : "type-964",
   "self_type" : "type-964",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/ui/include/ui/HdrCapabilities.h",
   "unique_id" : "_ZTSN7android15HdrCapabilitiesE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-233"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-179", "type-248" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-711"
    }
   ],
   "linker_set_key" : "android::KeyedVector<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::KeyedVector<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t>",
   "record_kind" : "class",
   "referenced_type" : "type-715",
   "self_type" : "type-715",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-142", "type-676" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::FrameStats>",
   "name" : "android::LightFlattenable<android::FrameStats>",
   "record_kind" : "class",
   "referenced_type" : "type-1419",
   "self_type" : "type-1419",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1420" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_10FrameStatsEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::HdrCapabilities>",
   "name" : "android::LightFlattenable<android::HdrCapabilities>",
   "record_kind" : "class",
   "referenced_type" : "type-963",
   "self_type" : "type-963",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-964" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_15HdrCapabilitiesEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Point>",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-1252",
   "self_type" : "type-1252",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1253" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Rect>",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-1244",
   "self_type" : "type-1244",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Region>",
   "name" : "android::LightFlattenable<android::Region>",
   "record_kind" : "class",
   "referenced_type" : "type-2222",
   "self_type" : "type-2222",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2221" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_6RegionEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1252"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Point>",
   "name" : "android::LightFlattenablePod<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-1254",
   "self_type" : "type-1254",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1253" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1244"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Rect>",
   "name" : "android::LightFlattenablePod<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-1243",
   "self_type" : "type-1243",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_4RectEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-1343"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::Fence>",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-1342",
   "self_type" : "type-1342",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1340" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-1134"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-1133",
   "self_type" : "type-1133",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1131" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-1327"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1326",
   "self_type" : "type-1326",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1328" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-253"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-256"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-255",
   "self_type" : "type-255",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1133"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-1132"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-1131",
   "self_type" : "type-1131",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1254"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android::Point",
   "name" : "android::Point",
   "record_kind" : "class",
   "referenced_type" : "type-1253",
   "self_type" : "type-1253",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Point.h",
   "unique_id" : "_ZTSN7android5PointE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-263"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-266"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-265",
   "self_type" : "type-265",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-266"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1242"
    },
    {
     "referenced_type" : "type-1243"
    }
   ],
   "linker_set_key" : "android::Rect",
   "name" : "android::Rect",
   "record_kind" : "class",
   "referenced_type" : "type-1241",
   "self_type" : "type-1241",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Rect.h",
   "unique_id" : "_ZTSN7android4RectE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-173"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-1080",
   "self_type" : "type-1080",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2222"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "referenced_type" : "type-2213"
    }
   ],
   "linker_set_key" : "android::Region",
   "name" : "android::Region",
   "record_kind" : "class",
   "referenced_type" : "type-2221",
   "self_type" : "type-2221",
   "size" : 20,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Region.h",
   "unique_id" : "_ZTSN7android6RegionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-1352",
   "self_type" : "type-1352",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Singleton<android::GraphicBufferAllocator>",
   "name" : "android::Singleton<android::GraphicBufferAllocator>",
   "record_kind" : "class",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Singleton.h",
   "template_args" : [ "type-542" ],
   "unique_id" : "_ZTSN7android9SingletonINS_22GraphicBufferAllocatorEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Singleton<android::GraphicBufferMapper>",
   "name" : "android::Singleton<android::GraphicBufferMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-530",
   "self_type" : "type-530",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Singleton.h",
   "template_args" : [ "type-527" ],
   "unique_id" : "_ZTSN7android9SingletonINS_19GraphicBufferMapperEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-234"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-237" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-234"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::SortedVector<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-711",
   "self_type" : "type-711",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-286"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-285",
   "self_type" : "type-285",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-370"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-227"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-252"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-258"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-270"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-270"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-367"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "android::Vector<android::Rect>",
   "name" : "android::Vector<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-2213",
   "self_type" : "type-2213",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android6VectorINS_4RectEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_4RectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "android::Vector<android::RefBase *>",
   "name" : "android::Vector<android::RefBase *>",
   "record_kind" : "class",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-246" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_7RefBaseEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "android::Vector<android::RefBase::weakref_type *>",
   "name" : "android::Vector<android::RefBase::weakref_type *>",
   "record_kind" : "class",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_7RefBase12weakref_typeEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::BHwBinder *>",
   "name" : "android::Vector<android::hardware::BHwBinder *>",
   "record_kind" : "class",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-241" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_8hardware9BHwBinderEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_8hardware9BHwBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_8hardware9BHwBinderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_8hardware9BHwBinderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-239" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "android::Vector<long long>",
   "name" : "android::Vector<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-1421",
   "self_type" : "type-1421",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android6VectorIxEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIxEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIxED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIxED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIxE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIxE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIxE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIxE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIxE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIxE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-227"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-236"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-236"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1326"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-1328",
   "self_type" : "type-1328",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::aggregate_traits<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142", "type-676" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-1333",
   "self_type" : "type-1333",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-1341",
   "self_type" : "type-1341",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-1333" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-905"
    },
    {
     "referenced_type" : "type-906"
    },
    {
     "referenced_type" : "type-907"
    },
    {
     "referenced_type" : "type-908"
    },
    {
     "referenced_type" : "type-909"
    },
    {
     "referenced_type" : "type-910"
    },
    {
     "referenced_type" : "type-911"
    },
    {
     "referenced_type" : "type-912"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_value",
     "referenced_type" : "type-904"
    }
   ],
   "linker_set_key" : "android::details::TMat33<float>",
   "name" : "android::details::TMat33<float>",
   "record_kind" : "class",
   "referenced_type" : "type-903",
   "self_type" : "type-903",
   "size" : 36,
   "source_file" : "/frameworks/native/libs/math/include/math/mat3.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details6TMat33IfEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2254"
    },
    {
     "referenced_type" : "type-2255"
    },
    {
     "referenced_type" : "type-2252"
    },
    {
     "referenced_type" : "type-2265"
    },
    {
     "referenced_type" : "type-2268"
    },
    {
     "referenced_type" : "type-2270"
    },
    {
     "referenced_type" : "type-2269"
    },
    {
     "referenced_type" : "type-2272"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_value",
     "referenced_type" : "type-2277"
    }
   ],
   "linker_set_key" : "android::details::TMat44<float>",
   "name" : "android::details::TMat44<float>",
   "record_kind" : "class",
   "referenced_type" : "type-2276",
   "self_type" : "type-2276",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/math/include/math/mat4.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details6TMat44IfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatDebug<android::details::TMat33, float>",
   "name" : "android::details::TMatDebug<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-912",
   "self_type" : "type-912",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details9TMatDebugINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatDebug<android::details::TMat44, float>",
   "name" : "android::details::TMatDebug<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2272",
   "self_type" : "type-2272",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details9TMatDebugINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatHelpers<android::details::TMat33, float>",
   "name" : "android::details::TMatHelpers<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-911",
   "self_type" : "type-911",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details11TMatHelpersINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatHelpers<android::details::TMat44, float>",
   "name" : "android::details::TMatHelpers<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2269",
   "self_type" : "type-2269",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details11TMatHelpersINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatProductOperators<android::details::TMat33, float>",
   "name" : "android::details::TMatProductOperators<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-908",
   "self_type" : "type-908",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details20TMatProductOperatorsINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatProductOperators<android::details::TMat44, float>",
   "name" : "android::details::TMatProductOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2265",
   "self_type" : "type-2265",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details20TMatProductOperatorsINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatSquareFunctions<android::details::TMat33, float>",
   "name" : "android::details::TMatSquareFunctions<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-909",
   "self_type" : "type-909",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details19TMatSquareFunctionsINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatSquareFunctions<android::details::TMat44, float>",
   "name" : "android::details::TMatSquareFunctions<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2268",
   "self_type" : "type-2268",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details19TMatSquareFunctionsINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatTransform<android::details::TMat33, float>",
   "name" : "android::details::TMatTransform<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-910",
   "self_type" : "type-910",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details13TMatTransformINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TMatTransform<android::details::TMat44, float>",
   "name" : "android::details::TMatTransform<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2270",
   "self_type" : "type-2270",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details13TMatTransformINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TQuatDebug<android::details::TQuaternion, double>",
   "name" : "android::details::TQuatDebug<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details10TQuatDebugINS0_11TQuaternionEdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TQuatDebug<android::details::TQuaternion, float>",
   "name" : "android::details::TQuatDebug<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details10TQuatDebugINS0_11TQuaternionEfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TQuatFunctions<android::details::TQuaternion, double>",
   "name" : "android::details::TQuatFunctions<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details14TQuatFunctionsINS0_11TQuaternionEdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TQuatFunctions<android::details::TQuaternion, float>",
   "name" : "android::details::TQuatFunctions<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details14TQuatFunctionsINS0_11TQuaternionEfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TQuatProductOperators<android::details::TQuaternion, double>",
   "name" : "android::details::TQuatProductOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details21TQuatProductOperatorsINS0_11TQuaternionEdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TQuatProductOperators<android::details::TQuaternion, float>",
   "name" : "android::details::TQuatProductOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details21TQuatProductOperatorsINS0_11TQuaternionEfEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-334"
    },
    {
     "referenced_type" : "type-335"
    },
    {
     "referenced_type" : "type-336"
    },
    {
     "referenced_type" : "type-40"
    },
    {
     "referenced_type" : "type-47"
    },
    {
     "referenced_type" : "type-49"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-332"
    }
   ],
   "linker_set_key" : "android::details::TQuaternion<double>",
   "name" : "android::details::TQuaternion<double>",
   "record_kind" : "class",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/quat.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details11TQuaternionIdEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "xyzw",
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "type-55"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TQuaternion<double>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5) at frameworks/native/libs/math/include/math/quat.h:65:5",
   "name" : "android::details::TQuaternion<double>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5) at frameworks/native/libs/math/include/math/quat.h:65:5",
   "record_kind" : "union",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/quat.h",
   "unique_id" : "_ZTSN7android7details11TQuaternionIdEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "z",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "w",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TQuaternion<double>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)::(anonymous struct at frameworks/native/libs/math/include/math/quat.h:66:9) at frameworks/native/libs/math/include/math/quat.h:66:9",
   "name" : "android::details::TQuaternion<double>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)::(anonymous struct at frameworks/native/libs/math/include/math/quat.h:66:9) at frameworks/native/libs/math/include/math/quat.h:66:9",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/quat.h",
   "unique_id" : "_ZTSN7android7details11TQuaternionIdEUt_Ut_E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-413"
    },
    {
     "referenced_type" : "type-414"
    },
    {
     "referenced_type" : "type-415"
    },
    {
     "referenced_type" : "type-38"
    },
    {
     "referenced_type" : "type-43"
    },
    {
     "referenced_type" : "type-48"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-411"
    }
   ],
   "linker_set_key" : "android::details::TQuaternion<float>",
   "name" : "android::details::TQuaternion<float>",
   "record_kind" : "class",
   "referenced_type" : "type-410",
   "self_type" : "type-410",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/quat.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details11TQuaternionIfEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-412"
    },
    {
     "field_name" : "xyzw",
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "type-22"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TQuaternion<float>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5) at frameworks/native/libs/math/include/math/quat.h:65:5",
   "name" : "android::details::TQuaternion<float>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5) at frameworks/native/libs/math/include/math/quat.h:65:5",
   "record_kind" : "union",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/quat.h",
   "unique_id" : "_ZTSN7android7details11TQuaternionIfEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "w",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TQuaternion<float>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)::(anonymous struct at frameworks/native/libs/math/include/math/quat.h:66:9) at frameworks/native/libs/math/include/math/quat.h:66:9",
   "name" : "android::details::TQuaternion<float>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)::(anonymous struct at frameworks/native/libs/math/include/math/quat.h:66:9) at frameworks/native/libs/math/include/math/quat.h:66:9",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/quat.h",
   "unique_id" : "_ZTSN7android7details11TQuaternionIfEUt_Ut_E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-396"
    },
    {
     "referenced_type" : "type-427"
    },
    {
     "referenced_type" : "type-462"
    },
    {
     "referenced_type" : "type-510"
    },
    {
     "referenced_type" : "type-600"
    },
    {
     "referenced_type" : "type-643"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::details::TVec2<bool>",
   "name" : "android::details::TVec2<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-1266",
   "self_type" : "type-1266",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android7details5TVec2IbEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "referenced_type" : "type-5"
    },
    {
     "referenced_type" : "type-7"
    },
    {
     "referenced_type" : "type-8"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5) at frameworks/native/libs/math/include/math/vec2.h:49:5",
   "name" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5) at frameworks/native/libs/math/include/math/vec2.h:49:5",
   "record_kind" : "union",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IbEUt_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "y",
     "field_offset" : 8,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9) at frameworks/native/libs/math/include/math/vec2.h:50:9",
   "name" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9) at frameworks/native/libs/math/include/math/vec2.h:50:9",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IbEUt_Ut_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "t",
     "field_offset" : 8,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9) at frameworks/native/libs/math/include/math/vec2.h:51:9",
   "name" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9) at frameworks/native/libs/math/include/math/vec2.h:51:9",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IbEUt_Ut0_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "g",
     "field_offset" : 8,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9) at frameworks/native/libs/math/include/math/vec2.h:52:9",
   "name" : "android::details::TVec2<bool>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9) at frameworks/native/libs/math/include/math/vec2.h:52:9",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IbEUt_Ut1_E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-60"
    },
    {
     "referenced_type" : "type-61"
    },
    {
     "referenced_type" : "type-62"
    },
    {
     "referenced_type" : "type-63"
    },
    {
     "referenced_type" : "type-64"
    },
    {
     "referenced_type" : "type-65"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "android::details::TVec2<double>",
   "name" : "android::details::TVec2<double>",
   "record_kind" : "class",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details5TVec2IdEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-57"
    },
    {
     "referenced_type" : "type-58"
    },
    {
     "referenced_type" : "type-59"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5) at frameworks/native/libs/math/include/math/vec2.h:49:5",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5) at frameworks/native/libs/math/include/math/vec2.h:49:5",
   "record_kind" : "union",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IdEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9) at frameworks/native/libs/math/include/math/vec2.h:50:9",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9) at frameworks/native/libs/math/include/math/vec2.h:50:9",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IdEUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9) at frameworks/native/libs/math/include/math/vec2.h:51:9",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9) at frameworks/native/libs/math/include/math/vec2.h:51:9",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IdEUt_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "g",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9) at frameworks/native/libs/math/include/math/vec2.h:52:9",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9) at frameworks/native/libs/math/include/math/vec2.h:52:9",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IdEUt_Ut1_E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-27"
    },
    {
     "referenced_type" : "type-28"
    },
    {
     "referenced_type" : "type-29"
    },
    {
     "referenced_type" : "type-30"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android::details::TVec2<float>",
   "name" : "android::details::TVec2<float>",
   "record_kind" : "class",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details5TVec2IfEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-24"
    },
    {
     "referenced_type" : "type-25"
    },
    {
     "referenced_type" : "type-26"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5) at frameworks/native/libs/math/include/math/vec2.h:49:5",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5) at frameworks/native/libs/math/include/math/vec2.h:49:5",
   "record_kind" : "union",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IfEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9) at frameworks/native/libs/math/include/math/vec2.h:50:9",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9) at frameworks/native/libs/math/include/math/vec2.h:50:9",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IfEUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9) at frameworks/native/libs/math/include/math/vec2.h:51:9",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9) at frameworks/native/libs/math/include/math/vec2.h:51:9",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IfEUt_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9) at frameworks/native/libs/math/include/math/vec2.h:52:9",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9) at frameworks/native/libs/math/include/math/vec2.h:52:9",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/math/include/math/vec2.h",
   "unique_id" : "_ZTSN7android7details5TVec2IfEUt_Ut1_E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-71"
    },
    {
     "referenced_type" : "type-72"
    },
    {
     "referenced_type" : "type-73"
    },
    {
     "referenced_type" : "type-74"
    },
    {
     "referenced_type" : "type-75"
    },
    {
     "referenced_type" : "type-76"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "android::details::TVec3<double>",
   "name" : "android::details::TVec3<double>",
   "record_kind" : "class",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details5TVec3IdEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-68"
    },
    {
     "referenced_type" : "type-69"
    },
    {
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "st",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "type-55"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5) at frameworks/native/libs/math/include/math/vec3.h:47:5",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5) at frameworks/native/libs/math/include/math/vec3.h:47:5",
   "record_kind" : "union",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IdEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "z",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:48:9) at frameworks/native/libs/math/include/math/vec3.h:48:9",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:48:9) at frameworks/native/libs/math/include/math/vec3.h:48:9",
   "referenced_type" : "type-68",
   "self_type" : "type-68",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IdEUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "p",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:49:9) at frameworks/native/libs/math/include/math/vec3.h:49:9",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:49:9) at frameworks/native/libs/math/include/math/vec3.h:49:9",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IdEUt_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "g",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "b",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:50:9) at frameworks/native/libs/math/include/math/vec3.h:50:9",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:50:9) at frameworks/native/libs/math/include/math/vec3.h:50:9",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IdEUt_Ut1_E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    },
    {
     "referenced_type" : "type-34"
    },
    {
     "referenced_type" : "type-9"
    },
    {
     "referenced_type" : "type-11"
    },
    {
     "referenced_type" : "type-12"
    },
    {
     "referenced_type" : "type-35"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "android::details::TVec3<float>",
   "name" : "android::details::TVec3<float>",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details5TVec3IfEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-19"
    },
    {
     "referenced_type" : "type-20"
    },
    {
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "st",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "type-22"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5) at frameworks/native/libs/math/include/math/vec3.h:47:5",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5) at frameworks/native/libs/math/include/math/vec3.h:47:5",
   "record_kind" : "union",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IfEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:48:9) at frameworks/native/libs/math/include/math/vec3.h:48:9",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:48:9) at frameworks/native/libs/math/include/math/vec3.h:48:9",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IfEUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "p",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:49:9) at frameworks/native/libs/math/include/math/vec3.h:49:9",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:49:9) at frameworks/native/libs/math/include/math/vec3.h:49:9",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IfEUt_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:50:9) at frameworks/native/libs/math/include/math/vec3.h:50:9",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:50:9) at frameworks/native/libs/math/include/math/vec3.h:50:9",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/math/include/math/vec3.h",
   "unique_id" : "_ZTSN7android7details5TVec3IfEUt_Ut1_E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-77"
    },
    {
     "referenced_type" : "type-78"
    },
    {
     "referenced_type" : "type-79"
    },
    {
     "referenced_type" : "type-80"
    },
    {
     "referenced_type" : "type-81"
    },
    {
     "referenced_type" : "type-82"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "android::details::TVec4<double>",
   "name" : "android::details::TVec4<double>",
   "record_kind" : "class",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details5TVec4IdEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-52"
    },
    {
     "referenced_type" : "type-53"
    },
    {
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "st",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "stp",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "rgb",
     "referenced_type" : "type-66"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5) at frameworks/native/libs/math/include/math/vec4.h:47:5",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5) at frameworks/native/libs/math/include/math/vec4.h:47:5",
   "record_kind" : "union",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IdEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "z",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "w",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:48:9) at frameworks/native/libs/math/include/math/vec4.h:48:9",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:48:9) at frameworks/native/libs/math/include/math/vec4.h:48:9",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IdEUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "p",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "q",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:49:9) at frameworks/native/libs/math/include/math/vec4.h:49:9",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:49:9) at frameworks/native/libs/math/include/math/vec4.h:49:9",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IdEUt_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "g",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "b",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "a",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:50:9) at frameworks/native/libs/math/include/math/vec4.h:50:9",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:50:9) at frameworks/native/libs/math/include/math/vec4.h:50:9",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IdEUt_Ut1_E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-205"
    },
    {
     "referenced_type" : "type-206"
    },
    {
     "referenced_type" : "type-207"
    },
    {
     "referenced_type" : "type-208"
    },
    {
     "referenced_type" : "type-209"
    },
    {
     "referenced_type" : "type-210"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "type-201"
    }
   ],
   "linker_set_key" : "android::details::TVec4<float>",
   "name" : "android::details::TVec4<float>",
   "record_kind" : "class",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details5TVec4IfEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-202"
    },
    {
     "referenced_type" : "type-203"
    },
    {
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "st",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "stp",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "rgb",
     "referenced_type" : "type-17"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5) at frameworks/native/libs/math/include/math/vec4.h:47:5",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5) at frameworks/native/libs/math/include/math/vec4.h:47:5",
   "record_kind" : "union",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IfEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "w",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:48:9) at frameworks/native/libs/math/include/math/vec4.h:48:9",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:48:9) at frameworks/native/libs/math/include/math/vec4.h:48:9",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IfEUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "p",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "q",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:49:9) at frameworks/native/libs/math/include/math/vec4.h:49:9",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:49:9) at frameworks/native/libs/math/include/math/vec4.h:49:9",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IfEUt_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "a",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:50:9) at frameworks/native/libs/math/include/math/vec4.h:50:9",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:50:9) at frameworks/native/libs/math/include/math/vec4.h:50:9",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/math/include/math/vec4.h",
   "unique_id" : "_ZTSN7android7details5TVec4IfEUt_Ut1_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TMat33, float>",
   "name" : "android::details::TVecAddOperators<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-907",
   "self_type" : "type-907",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TMat44, float>",
   "name" : "android::details::TVecAddOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2252",
   "self_type" : "type-2252",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TQuaternion, double>",
   "name" : "android::details::TVecAddOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "type-334",
   "self_type" : "type-334",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_11TQuaternionEdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TQuaternion, float>",
   "name" : "android::details::TVecAddOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_11TQuaternionEfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TVec2, bool>",
   "name" : "android::details::TVecAddOperators<android::details::TVec2, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_5TVec2EbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TVec2, double>",
   "name" : "android::details::TVecAddOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_5TVec2EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TVec2, float>",
   "name" : "android::details::TVecAddOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_5TVec2EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TVec3, double>",
   "name" : "android::details::TVecAddOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_5TVec3EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TVec3, float>",
   "name" : "android::details::TVecAddOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_5TVec3EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TVec4, double>",
   "name" : "android::details::TVecAddOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_5TVec4EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecAddOperators<android::details::TVec4, float>",
   "name" : "android::details::TVecAddOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details16TVecAddOperatorsINS0_5TVec4EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TMat33, float>",
   "name" : "android::details::TVecComparisonOperators<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-906",
   "self_type" : "type-906",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TMat44, float>",
   "name" : "android::details::TVecComparisonOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2255",
   "self_type" : "type-2255",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TQuaternion, double>",
   "name" : "android::details::TVecComparisonOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TQuaternion, float>",
   "name" : "android::details::TVecComparisonOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "type-415",
   "self_type" : "type-415",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TVec2, bool>",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec2, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-510",
   "self_type" : "type-510",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_5TVec2EbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TVec2, double>",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_5TVec2EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TVec2, float>",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_5TVec2EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TVec3, double>",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_5TVec3EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TVec3, float>",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_5TVec3EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TVec4, double>",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_5TVec4EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecComparisonOperators<android::details::TVec4, float>",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "type-208",
   "self_type" : "type-208",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details23TVecComparisonOperatorsINS0_5TVec4EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecDebug<android::details::TVec2, bool>",
   "name" : "android::details::TVecDebug<android::details::TVec2, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android7details9TVecDebugINS0_5TVec2EbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecDebug<android::details::TVec2, double>",
   "name" : "android::details::TVecDebug<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details9TVecDebugINS0_5TVec2EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecDebug<android::details::TVec2, float>",
   "name" : "android::details::TVecDebug<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details9TVecDebugINS0_5TVec2EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecDebug<android::details::TVec3, double>",
   "name" : "android::details::TVecDebug<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details9TVecDebugINS0_5TVec3EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecDebug<android::details::TVec3, float>",
   "name" : "android::details::TVecDebug<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details9TVecDebugINS0_5TVec3EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecDebug<android::details::TVec4, double>",
   "name" : "android::details::TVecDebug<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details9TVecDebugINS0_5TVec4EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecDebug<android::details::TVec4, float>",
   "name" : "android::details::TVecDebug<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "type-210",
   "self_type" : "type-210",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details9TVecDebugINS0_5TVec4EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecFunctions<android::details::TVec2, bool>",
   "name" : "android::details::TVecFunctions<android::details::TVec2, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-600",
   "self_type" : "type-600",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android7details13TVecFunctionsINS0_5TVec2EbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecFunctions<android::details::TVec2, double>",
   "name" : "android::details::TVecFunctions<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details13TVecFunctionsINS0_5TVec2EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecFunctions<android::details::TVec2, float>",
   "name" : "android::details::TVecFunctions<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details13TVecFunctionsINS0_5TVec2EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecFunctions<android::details::TVec3, double>",
   "name" : "android::details::TVecFunctions<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details13TVecFunctionsINS0_5TVec3EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecFunctions<android::details::TVec3, float>",
   "name" : "android::details::TVecFunctions<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details13TVecFunctionsINS0_5TVec3EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecFunctions<android::details::TVec4, double>",
   "name" : "android::details::TVecFunctions<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details13TVecFunctionsINS0_5TVec4EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecFunctions<android::details::TVec4, float>",
   "name" : "android::details::TVecFunctions<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "type-209",
   "self_type" : "type-209",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details13TVecFunctionsINS0_5TVec4EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecProductOperators<android::details::TVec2, bool>",
   "name" : "android::details::TVecProductOperators<android::details::TVec2, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android7details20TVecProductOperatorsINS0_5TVec2EbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecProductOperators<android::details::TVec2, double>",
   "name" : "android::details::TVecProductOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details20TVecProductOperatorsINS0_5TVec2EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecProductOperators<android::details::TVec2, float>",
   "name" : "android::details::TVecProductOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details20TVecProductOperatorsINS0_5TVec2EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecProductOperators<android::details::TVec3, double>",
   "name" : "android::details::TVecProductOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details20TVecProductOperatorsINS0_5TVec3EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecProductOperators<android::details::TVec3, float>",
   "name" : "android::details::TVecProductOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details20TVecProductOperatorsINS0_5TVec3EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecProductOperators<android::details::TVec4, double>",
   "name" : "android::details::TVecProductOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details20TVecProductOperatorsINS0_5TVec4EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecProductOperators<android::details::TVec4, float>",
   "name" : "android::details::TVecProductOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details20TVecProductOperatorsINS0_5TVec4EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TMat33, float>",
   "name" : "android::details::TVecUnaryOperators<android::details::TMat33, float>",
   "record_kind" : "class",
   "referenced_type" : "type-905",
   "self_type" : "type-905",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_6TMat33EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TMat44, float>",
   "name" : "android::details::TVecUnaryOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "type-2254",
   "self_type" : "type-2254",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_6TMat44EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TQuaternion, double>",
   "name" : "android::details::TVecUnaryOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TQuaternion, float>",
   "name" : "android::details::TVecUnaryOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TVec2, bool>",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec2, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_5TVec2EbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TVec2, double>",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_5TVec2EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TVec2, float>",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_5TVec2EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TVec3, double>",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_5TVec3EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TVec3, float>",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_5TVec3EfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TVec4, double>",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_5TVec4EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::details::TVecUnaryOperators<android::details::TVec4, float>",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "type-207",
   "self_type" : "type-207",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android7details18TVecUnaryOperatorsINS0_5TVec4EfEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::half",
   "name" : "android::half",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/math/include/math/half.h",
   "unique_id" : "_ZTSN7android4halfE"
  },
  {
   "access" : "private",
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::half::fp16",
   "name" : "android::half::fp16",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/math/include/math/half.h",
   "unique_id" : "_ZTSN7android4half4fp16E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1067"
    }
   ],
   "linker_set_key" : "android::half::fp32",
   "name" : "android::half::fp32",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/math/include/math/half.h",
   "unique_id" : "_ZTSN7android4half4fp32E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "fp",
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::half::fp32::(anonymous union at frameworks/native/libs/math/include/math/half.h:70:9) at frameworks/native/libs/math/include/math/half.h:70:9",
   "name" : "android::half::fp32::(anonymous union at frameworks/native/libs/math/include/math/half.h:70:9) at frameworks/native/libs/math/include/math/half.h:70:9",
   "record_kind" : "union",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/math/include/math/half.h",
   "unique_id" : "_ZTSN7android4half4fp32Ut_E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-196"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 96,
     "referenced_type" : "type-243"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-227"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 28,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-194"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-197"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-199"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-1101",
   "self_type" : "type-1101",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-1085"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-1093",
   "self_type" : "type-1093",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-213",
   "self_type" : "type-213",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mProcess",
     "referenced_type" : "type-278"
    },
    {
     "access" : "private",
     "field_name" : "mPendingStrongDerefs",
     "field_offset" : 32,
     "referenced_type" : "type-240"
    },
    {
     "access" : "private",
     "field_name" : "mPendingWeakDerefs",
     "field_offset" : 192,
     "referenced_type" : "type-244"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteStrongDerefs",
     "field_offset" : 352,
     "referenced_type" : "type-245"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteWeakDerefs",
     "field_offset" : 512,
     "referenced_type" : "type-244"
    },
    {
     "access" : "private",
     "field_name" : "mIn",
     "field_offset" : 672,
     "referenced_type" : "type-215"
    },
    {
     "access" : "private",
     "field_name" : "mOut",
     "field_offset" : 1216,
     "referenced_type" : "type-215"
    },
    {
     "access" : "private",
     "field_name" : "mLastError",
     "field_offset" : 1760,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mCallingPid",
     "field_offset" : 1792,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mCallingSid",
     "field_offset" : 1824,
     "referenced_type" : "type-286"
    },
    {
     "access" : "private",
     "field_name" : "mCallingUid",
     "field_offset" : 1856,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mStrictModePolicy",
     "field_offset" : 1888,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mLastTransactionBinderFlags",
     "field_offset" : 1920,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mContextObject",
     "field_offset" : 1952,
     "referenced_type" : "type-289"
    },
    {
     "access" : "private",
     "field_name" : "mIsLooper",
     "field_offset" : 1984,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mIsPollingThread",
     "field_offset" : 1992,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mPostCommandTasks",
     "field_offset" : 2016,
     "referenced_type" : "type-290"
    },
    {
     "access" : "private",
     "field_name" : "mIPCThreadStateBase",
     "field_offset" : 2112,
     "referenced_type" : "type-291"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 2144,
     "referenced_type" : "type-276"
    }
   ],
   "linker_set_key" : "android::hardware::IPCThreadState",
   "name" : "android::hardware::IPCThreadState",
   "record_kind" : "class",
   "referenced_type" : "type-277",
   "self_type" : "type-277",
   "size" : 272,
   "source_file" : "/system/libhwbinder/include/hwbinder/IPCThreadState.h",
   "unique_id" : "_ZTSN7android8hardware14IPCThreadStateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 32,
     "referenced_type" : "type-216"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 128,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 160,
     "referenced_type" : "type-217"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 192,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 288,
     "referenced_type" : "type-219"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 320,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 352,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 384,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 416,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 456,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 464,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 480,
     "referenced_type" : "type-220"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 512,
     "referenced_type" : "type-227"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 68,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 64,
     "referenced_type" : "type-227"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 96,
     "referenced_type" : "type-282"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 128,
     "referenced_type" : "type-283"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 160,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 192,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 256,
     "referenced_type" : "type-284"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 320,
     "referenced_type" : "type-252"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 352,
     "referenced_type" : "type-238"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 544,
     "referenced_type" : "type-274"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 576,
     "referenced_type" : "type-227"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 608,
     "referenced_type" : "type-247"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 768,
     "referenced_type" : "type-285"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 800,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 808,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 832,
     "referenced_type" : "type-275"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 864,
     "referenced_type" : "type-236"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 896,
     "referenced_type" : "type-276"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 128,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 116,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-195"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-101"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-100"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error>",
   "name" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error>",
   "record_kind" : "class",
   "referenced_type" : "type-99",
   "self_type" : "type-99",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-105" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_8graphics6mapper4V2_05ErrorEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-101"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-394"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::mapper::V3_0::Error>",
   "name" : "android::hardware::Return<android::hardware::graphics::mapper::V3_0::Error>",
   "record_kind" : "class",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-395" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_8graphics6mapper4V3_05ErrorEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-101"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::graphics::mapper::V2_1::IMapper> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::graphics::mapper::V2_1::IMapper> >",
   "record_kind" : "class",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-86" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_8graphics6mapper4V2_17IMapperEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-101"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1322",
   "self_type" : "type-1322",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-104"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "type-1181"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "type-1182"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "type-1183"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-1180",
   "self_type" : "type-1180",
   "size" : 44,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-1316",
   "self_type" : "type-1316",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-1330",
   "self_type" : "type-1330",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-1332",
   "self_type" : "type-1332",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-1104"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "name" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "referenced_type" : "type-1103",
   "self_type" : "type-1103",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIjLj10EJEEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1100"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1099",
   "self_type" : "type-1099",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1099"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-1101" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-137"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_handle>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_handle>",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-139" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_handleEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1072"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-1071",
   "self_type" : "type-1071",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-287" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1072",
   "self_type" : "type-1072",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-143" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_handleEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1151"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-1150",
   "self_type" : "type-1150",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1132"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1151",
   "self_type" : "type-1151",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-121"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-1306",
   "self_type" : "type-1306",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-102"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned int, 10>",
   "name" : "android::hardware::details::std_array<unsigned int, 10>",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIjLj10EJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "description",
     "referenced_type" : "type-1108"
    },
    {
     "field_name" : "nativeHandle",
     "field_offset" : 320,
     "referenced_type" : "type-139"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::common::V1_2::HardwareBuffer",
   "name" : "android::hardware::graphics::common::V1_2::HardwareBuffer",
   "referenced_type" : "type-1193",
   "self_type" : "type-1193",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/1.2/android.hardware.graphics.common@1.2_genc++_headers/gen/android/hardware/graphics/common/1.2/types.h",
   "unique_id" : "_ZTSN7android8hardware8graphics6common4V1_214HardwareBufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1109"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned int, 10>",
   "name" : "android::hardware::hidl_array<unsigned int, 10>",
   "referenced_type" : "type-1108",
   "self_type" : "type-1108",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIjLj10EJEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::hidl_enum_range<android::hardware::graphics::common::V1_0::BufferUsage, void>",
   "name" : "android::hardware::hidl_enum_range<android::hardware::graphics::common::V1_0::BufferUsage, void>",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-150", "type-151" ],
   "unique_id" : "_ZTSN7android8hardware15hidl_enum_rangeINS0_8graphics6common4V1_011BufferUsageEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::hidl_enum_range<android::hardware::graphics::common::V1_1::BufferUsage, void>",
   "name" : "android::hardware::hidl_enum_range<android::hardware::graphics::common::V1_1::BufferUsage, void>",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-158", "type-151" ],
   "unique_id" : "_ZTSN7android8hardware15hidl_enum_rangeINS0_8graphics6common4V1_111BufferUsageEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::hidl_enum_range<android::hardware::graphics::common::V1_2::BufferUsage, void>",
   "name" : "android::hardware::hidl_enum_range<android::hardware::graphics::common::V1_2::BufferUsage, void>",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-420", "type-151" ],
   "unique_id" : "_ZTSN7android8hardware15hidl_enum_rangeINS0_8graphics6common4V1_211BufferUsageEvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-140"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-139"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-124"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-1082"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-1085",
   "self_type" : "type-1085",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1071"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-1082",
   "self_type" : "type-1082",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1098"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-1097",
   "self_type" : "type-1097",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-1101" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_handle>",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_handle>",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-139" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_11hidl_handleEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-120"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<unsigned int>",
   "name" : "android::hardware::hidl_vec<unsigned int>",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIjEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-1113",
   "self_type" : "type-1113",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "type-164"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_09DebugInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::IBase",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_05IBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-171"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceNotification",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-295",
   "self_type" : "type-295",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_020IServiceNotificationE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-676"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-694",
   "self_type" : "type-694",
   "size" : 56,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142", "type-676" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1358"
    }
   ],
   "linker_set_key" : "android::sp<android::Fence>",
   "name" : "android::sp<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-1357",
   "self_type" : "type-1357",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1340" ],
   "unique_id" : "_ZTSN7android2spINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-680"
    }
   ],
   "linker_set_key" : "android::sp<android::GraphicBuffer>",
   "name" : "android::sp<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-679",
   "self_type" : "type-679",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSN7android2spINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-368"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-369" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-241"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::BHwBinder>",
   "name" : "android::sp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-242" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-195"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder>",
   "name" : "android::sp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-196" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-280"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::ProcessState>",
   "name" : "android::sp<android::hardware::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-281" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware12ProcessStateEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::allocator::V2_0::IAllocator>",
   "name" : "android::sp<android::hardware::graphics::allocator::V2_0::IAllocator>",
   "record_kind" : "class",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-358" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics9allocator4V2_010IAllocatorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-485"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::allocator::V3_0::IAllocator>",
   "name" : "android::sp<android::hardware::graphics::allocator::V3_0::IAllocator>",
   "record_kind" : "class",
   "referenced_type" : "type-484",
   "self_type" : "type-484",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics9allocator4V3_010IAllocatorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::mapper::V2_0::IMapper>",
   "name" : "android::sp<android::hardware::graphics::mapper::V2_0::IMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-341" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics6mapper4V2_07IMapperEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-87"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::mapper::V2_1::IMapper>",
   "name" : "android::sp<android::hardware::graphics::mapper::V2_1::IMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-89" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics6mapper4V2_17IMapperEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-498"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::mapper::V3_0::IMapper>",
   "name" : "android::sp<android::hardware::graphics::mapper::V3_0::IMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-497",
   "self_type" : "type-497",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics6mapper4V3_07IMapperEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1126"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-1125",
   "self_type" : "type-1125",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1127" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-364"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::base::V1_0::IBase>",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-363",
   "self_type" : "type-363",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-171" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-372"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "type-371",
   "self_type" : "type-371",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-295" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::trait_pointer<android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-819",
   "self_type" : "type-819",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::Rect>",
   "name" : "android::trait_pointer<android::Rect>",
   "referenced_type" : "type-2234",
   "self_type" : "type-2234",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "referenced_type" : "type-817",
   "self_type" : "type-817",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<const native_handle *>",
   "name" : "android::trait_pointer<const native_handle *>",
   "referenced_type" : "type-818",
   "self_type" : "type-818",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPK13native_handleEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<long long>",
   "name" : "android::trait_pointer<long long>",
   "referenced_type" : "type-1430",
   "self_type" : "type-1430",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android13trait_pointerIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::trait_trivial_copy<android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-812",
   "self_type" : "type-812",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::Point>",
   "name" : "android::trait_trivial_copy<android::Point>",
   "referenced_type" : "type-1288",
   "self_type" : "type-1288",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "type-1253" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::Rect>",
   "name" : "android::trait_trivial_copy<android::Rect>",
   "referenced_type" : "type-1303",
   "self_type" : "type-1303",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "referenced_type" : "type-813",
   "self_type" : "type-813",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-483",
   "self_type" : "type-483",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-512",
   "self_type" : "type-512",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-288" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<const native_handle *>",
   "name" : "android::trait_trivial_copy<const native_handle *>",
   "referenced_type" : "type-811",
   "self_type" : "type-811",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPK13native_handleEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-795",
   "self_type" : "type-795",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-741",
   "self_type" : "type-741",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-704",
   "self_type" : "type-704",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-599" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-540",
   "self_type" : "type-540",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-218" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-675",
   "self_type" : "type-675",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-751",
   "self_type" : "type-751",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-124" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-722",
   "self_type" : "type-722",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::trait_trivial_ctor<android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-807",
   "self_type" : "type-807",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::Point>",
   "name" : "android::trait_trivial_ctor<android::Point>",
   "referenced_type" : "type-1286",
   "self_type" : "type-1286",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "type-1253" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::Rect>",
   "name" : "android::trait_trivial_ctor<android::Rect>",
   "referenced_type" : "type-1301",
   "self_type" : "type-1301",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "referenced_type" : "type-805",
   "self_type" : "type-805",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-481",
   "self_type" : "type-481",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-288" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<const native_handle *>",
   "name" : "android::trait_trivial_ctor<const native_handle *>",
   "referenced_type" : "type-806",
   "self_type" : "type-806",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPK13native_handleEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-781",
   "self_type" : "type-781",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-729",
   "self_type" : "type-729",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-598",
   "self_type" : "type-598",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-599" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-218" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-661",
   "self_type" : "type-661",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-746",
   "self_type" : "type-746",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-124" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-709",
   "self_type" : "type-709",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::trait_trivial_dtor<android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-809",
   "self_type" : "type-809",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::Point>",
   "name" : "android::trait_trivial_dtor<android::Point>",
   "referenced_type" : "type-1287",
   "self_type" : "type-1287",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "type-1253" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::Rect>",
   "name" : "android::trait_trivial_dtor<android::Rect>",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-511",
   "self_type" : "type-511",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-288" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<const native_handle *>",
   "name" : "android::trait_trivial_dtor<const native_handle *>",
   "referenced_type" : "type-808",
   "self_type" : "type-808",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPK13native_handleEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-786",
   "self_type" : "type-786",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-754",
   "self_type" : "type-754",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-738",
   "self_type" : "type-738",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-692",
   "self_type" : "type-692",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-610",
   "self_type" : "type-610",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-599" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-218" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-668",
   "self_type" : "type-668",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-124" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-719",
   "self_type" : "type-719",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-469",
   "self_type" : "type-469",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::trait_trivial_move<android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-815",
   "self_type" : "type-815",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::Point>",
   "name" : "android::trait_trivial_move<android::Point>",
   "referenced_type" : "type-1289",
   "self_type" : "type-1289",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "type-1253" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::Rect>",
   "name" : "android::trait_trivial_move<android::Rect>",
   "referenced_type" : "type-1304",
   "self_type" : "type-1304",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String16>",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "type-179" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-902",
   "self_type" : "type-902",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-285" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "referenced_type" : "type-816",
   "self_type" : "type-816",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-288" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<const native_handle *>",
   "name" : "android::trait_trivial_move<const native_handle *>",
   "referenced_type" : "type-814",
   "self_type" : "type-814",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPK13native_handleEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-798",
   "self_type" : "type-798",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-742",
   "self_type" : "type-742",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-708",
   "self_type" : "type-708",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-618",
   "self_type" : "type-618",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-599" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-218" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-123" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-124" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-728",
   "self_type" : "type-728",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-635",
   "self_type" : "type-635",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::GraphicBufferAllocator::alloc_rec_t>",
   "name" : "android::traits<android::GraphicBufferAllocator::alloc_rec_t>",
   "referenced_type" : "type-823",
   "self_type" : "type-823",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSN7android6traitsINS_22GraphicBufferAllocator11alloc_rec_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::Rect>",
   "name" : "android::traits<android::Rect>",
   "referenced_type" : "type-2235",
   "self_type" : "type-2235",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android6traitsINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::traits<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "referenced_type" : "type-820",
   "self_type" : "type-820",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<const native_handle *>",
   "name" : "android::traits<const native_handle *>",
   "referenced_type" : "type-822",
   "self_type" : "type-822",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android6traitsIPK13native_handleEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<long long>",
   "name" : "android::traits<long long>",
   "referenced_type" : "type-1431",
   "self_type" : "type-1431",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android6traitsIxEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android::ui::Size",
   "name" : "android::ui::Size",
   "referenced_type" : "type-1291",
   "self_type" : "type-1291",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Size.h",
   "unique_id" : "_ZTSN7android2ui4SizeE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMatrix",
     "referenced_type" : "type-2284"
    },
    {
     "access" : "private",
     "field_name" : "mType",
     "field_offset" : 288,
     "referenced_type" : "type-123"
    }
   ],
   "linker_set_key" : "android::ui::Transform",
   "name" : "android::ui::Transform",
   "record_kind" : "class",
   "referenced_type" : "type-2283",
   "self_type" : "type-2283",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Transform.h",
   "unique_id" : "_ZTSN7android2ui9TransformE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "type-904"
    }
   ],
   "linker_set_key" : "android::ui::Transform::mat33",
   "name" : "android::ui::Transform::mat33",
   "referenced_type" : "type-2284",
   "self_type" : "type-2284",
   "size" : 36,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Transform.h",
   "unique_id" : "_ZTSN7android2ui9Transform5mat33E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2209"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::Rect>",
   "name" : "android::use_trivial_move<android::Rect>",
   "referenced_type" : "type-2208",
   "self_type" : "type-2208",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-701"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<const native_handle *, android::GraphicBufferAllocator::alloc_rec_t> >",
   "referenced_type" : "type-700",
   "self_type" : "type-700",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-694" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tIPK13native_handleNS_22GraphicBufferAllocator11alloc_rec_tEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1417"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<long long>",
   "name" : "android::use_trivial_move<long long>",
   "referenced_type" : "type-1416",
   "self_type" : "type-1416",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIxEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-1234",
   "self_type" : "type-1234",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-1231"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-1230",
   "self_type" : "type-1230",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-1227"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-1229"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-1228",
   "self_type" : "type-1228",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-217"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-1225"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-1226",
   "self_type" : "type-1226",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 192,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 224,
     "referenced_type" : "type-520"
    }
   ],
   "linker_set_key" : "android_native_base_t",
   "name" : "android_native_base_t",
   "referenced_type" : "type-518",
   "self_type" : "type-518",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_base_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android_native_rect_t",
   "name" : "android_native_rect_t",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_rect_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-1232"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-1232"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-1232"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-1232"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-1233",
   "self_type" : "type-1233",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-1232",
   "self_type" : "type-1232",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-348",
   "self_type" : "type-348",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "flags",
     "field_offset" : 512,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "width",
     "field_offset" : 544,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "height",
     "field_offset" : 576,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "stride",
     "field_offset" : 608,
     "referenced_type" : "type-562"
    },
    {
     "field_name" : "format",
     "field_offset" : 640,
     "referenced_type" : "type-562"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 672,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 704,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "fps",
     "field_offset" : 736,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 768,
     "referenced_type" : "type-562"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 800,
     "referenced_type" : "type-562"
    },
    {
     "field_name" : "numFramebuffers",
     "field_offset" : 832,
     "referenced_type" : "type-562"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 864,
     "referenced_type" : "type-564"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 1088,
     "referenced_type" : "type-565"
    },
    {
     "field_name" : "setUpdateRect",
     "field_offset" : 1120,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "post",
     "field_offset" : 1152,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "compositionComplete",
     "field_offset" : 1184,
     "referenced_type" : "type-572"
    },
    {
     "field_name" : "dump",
     "field_offset" : 1216,
     "referenced_type" : "type-574"
    },
    {
     "field_name" : "enableScreen",
     "field_offset" : 1248,
     "referenced_type" : "type-565"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1280,
     "referenced_type" : "type-524"
    }
   ],
   "linker_set_key" : "framebuffer_device_t",
   "name" : "framebuffer_device_t",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 184,
   "source_file" : "/hardware/libhardware/include/hardware/fb.h",
   "unique_id" : "framebuffer_device_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-549"
    },
    {
     "field_name" : "registerBuffer",
     "field_offset" : 1024,
     "referenced_type" : "type-579"
    },
    {
     "field_name" : "unregisterBuffer",
     "field_offset" : 1056,
     "referenced_type" : "type-579"
    },
    {
     "field_name" : "lock",
     "field_offset" : 1088,
     "referenced_type" : "type-583"
    },
    {
     "field_name" : "unlock",
     "field_offset" : 1120,
     "referenced_type" : "type-579"
    },
    {
     "field_name" : "perform",
     "field_offset" : 1152,
     "referenced_type" : "type-585"
    },
    {
     "field_name" : "lock_ycbcr",
     "field_offset" : 1184,
     "referenced_type" : "type-587"
    },
    {
     "field_name" : "lockAsync",
     "field_offset" : 1216,
     "referenced_type" : "type-589"
    },
    {
     "field_name" : "unlockAsync",
     "field_offset" : 1248,
     "referenced_type" : "type-591"
    },
    {
     "field_name" : "lockAsync_ycbcr",
     "field_offset" : 1280,
     "referenced_type" : "type-594"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1312,
     "referenced_type" : "type-596"
    }
   ],
   "linker_set_key" : "gralloc_module_t",
   "name" : "gralloc_module_t",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 176,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h",
   "unique_id" : "gralloc_module_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "module",
     "field_offset" : 64,
     "referenced_type" : "type-548"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 96,
     "referenced_type" : "type-559"
    },
    {
     "field_name" : "close",
     "field_offset" : 480,
     "referenced_type" : "type-560"
    }
   ],
   "linker_set_key" : "hw_device_t",
   "name" : "hw_device_t",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 64,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_device_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "open",
     "referenced_type" : "type-552"
    }
   ],
   "linker_set_key" : "hw_module_methods_t",
   "name" : "hw_module_methods_t",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 4,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_module_methods_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "module_api_version",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hal_api_version",
     "field_offset" : 48,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "author",
     "field_offset" : 128,
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "methods",
     "field_offset" : 160,
     "referenced_type" : "type-550"
    },
    {
     "field_name" : "dso",
     "field_offset" : 192,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 224,
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "hw_module_t",
   "name" : "hw_module_t",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 128,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_module_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1269"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-1268",
   "self_type" : "type-1268",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-1270"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-1267"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-1267"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-1263"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-1262"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-1260"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-1269",
   "self_type" : "type-1269",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-123"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-1259",
   "self_type" : "type-1259",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-1261"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-1260",
   "self_type" : "type-1260",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-1261"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-1262",
   "self_type" : "type-1262",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-1261"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-1263",
   "self_type" : "type-1263",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-1261"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-1267",
   "self_type" : "type-1267",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-435"
    }
   ],
   "linker_set_key" : "std::is_floating_point<android::half>",
   "name" : "std::is_floating_point<android::half>",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/half.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIN7android4halfEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::numeric_limits<android::half>",
   "name" : "std::numeric_limits<android::half>",
   "record_kind" : "class",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/math/include/math/half.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIN7android4halfEEE"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "android::FenceTime::Snapshot &&",
   "name" : "android::FenceTime::Snapshot &&",
   "referenced_type" : "type-1383",
   "self_type" : "type-1386",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::HdrCapabilities &&",
   "name" : "android::HdrCapabilities &&",
   "referenced_type" : "type-964",
   "self_type" : "type-970",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/ui/include/ui/HdrCapabilities.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "type-1341",
   "self_type" : "type-1364",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error> &&",
   "name" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error> &&",
   "referenced_type" : "type-99",
   "self_type" : "type-107",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::mapper::V3_0::Error> &&",
   "name" : "android::hardware::Return<android::hardware::graphics::mapper::V3_0::Error> &&",
   "referenced_type" : "type-393",
   "self_type" : "type-399",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::graphics::mapper::V2_1::IMapper> > &&",
   "name" : "android::hardware::Return<android::sp<android::hardware::graphics::mapper::V2_1::IMapper> > &&",
   "referenced_type" : "type-111",
   "self_type" : "type-113",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<void> &&",
   "name" : "android::hardware::Return<void> &&",
   "referenced_type" : "type-1322",
   "self_type" : "type-1324",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Status &&",
   "name" : "android::hardware::Status &&",
   "referenced_type" : "type-102",
   "self_type" : "type-1312",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::details::return_status &&",
